#+TITLE: Linux Kernel Secret Caching Service
#+AUTHOR: Josh Dukes
#+EMAIL: hex@neg9.org

** show keys
To view the current state of the keyring (that is, what keys we have
access to right now), we can use the `show` option of the `keyctl`
command:

#+name: show_keys
#+begin_src sh
  keyctl show
#+end_src

#+RESULTS: show_keys
:RESULTS:
Session Keyring
 694337165 --alswrv   1000 65534  keyring: _uid_ses.1000
 571672433 --alswrv   1000 65534   \_ keyring: _uid.1000
:END:

If software is using the system, we may see keys here. In my
configuration after a fresh boot we only see the session keyring and
user keyring. Keyrings are simply a special type of key that holds
other keys. 

** add keys
We can add keys with the `add` option to the `keyctl` command. The
option takes several arguments:

#+name: keyctl_add_help
#+begin_example
  keyctl add <type> <desc> <data> <keyring>
#+end_example

The `type` describes the type of key to be used. The `user` type can
be used for arbitrary user defined keys. For our purposes all keys
will be `user` keys. Kernel documentation describes key types in
greater detail, further discussion of key types is beyond the scope of
this document. 

The `desc` argument is the description. It is an identifier that can be used to
look up keys. Later, when discussing resolvers, we will talk about
it's other purpose. For now, treat this as an arbitrary string.

The key's `data` is the content of the key. this is what we're storing
inside of it.

The `keyring` is the container in to which the key is going. Several
keyrings exist, allowing keys to be placed in containers accessible
only to the user, the session, the process, or the thread. More detail
on these containers can be found in the kernel documentation and is
out of scope for this document. For our purposes we will only use the
session and user keyrings.

The following command adds a user key with the description "test key"
and the content "this is some data" to the user's keyring:

#+name: add_key
#+headers: :var NAME="test key"
#+headers: :var DATA="this is some data"
#+begin_src sh
  keyctl add user "$NAME" "$DATA" @u  
#+end_src

#+RESULTS: add_key
: 498899265

The command returns a key identifier: a number we can use to look up
the key in the future. Lets look at my keyring now:

#+call: show_keys()

#+RESULTS:
: Session Keyring
:  694337165 --alswrv   1000 65534  keyring: _uid_ses.1000
:  571672433 --alswrv   1000 65534   \_ keyring: _uid.1000
:  498899265 --alswrv   1000  1000       \_ user: test key

Notice that the new key is now attached to my keyring. 

** print data in keys 
With the new key added we can now look inside the key to find what
data we stored in it. This is done with the `print` operation:

#+name: print_key
#+headers: :var KEYNUM=add_key()
#+begin_src sh 
  keyctl print $KEYNUM
#+end_src

#+RESULTS: print_key
: this is some data

We see that the content we put in is the content we print out, exactly
as expected. Content may be human readable strings or arbitrary
bytes. The `padd` command allows you to pass data to the key via a
pipe instead of as an argument. Lets add some random bytes and see
what happens:

#+name: padd_key
#+headers: :var NAME="test blob key"
#+begin_src sh 
  dd if=/dev/random count=10 bs=1 | keyctl padd user "blob key" @u
#+end_src

#+RESULTS: padd_key
: 480064895

When we print out our new "blob key," we see that it's helpfully hex
encoded:

#+name: print_blob_key
#+headers: :var KEYNUM=padd_key()
#+begin_src sh 
  keyctl print $KEYNUM
#+end_src

#+RESULTS: print_blob_key
: :hex:ffb5d4f9297f9473d57b

** deleting keys
Lets start by looking at our keyring again:

#+call: show_keys()

#+RESULTS:
:RESULTS:
"Session Keyring
 694337165 --alswrv   1000 65534  keyring: _uid_ses.1000
 571672433 --alswrv   1000 65534   \\_ keyring: _uid.1000
 498899265 --alswrv   1000  1000       \\_ user: test key
 354275757 --alswrv   1000  1000       \\_ user: blob key
"
:END:

We see both our "test key" and our "blob key" are in our keyring. Lets
clean it up a bit:

#+name: del_key
#+headers: :var KEYNUM=add_key()
#+begin_src sh
  keyctl unlink $KEYNUM
#+end_src

#+RESULTS: del_key
:RESULTS:
1 links removed
:END:

#+call: del_key(KEYNUM=padd_key())

#+RESULTS:
:RESULTS:
"1 links removed
"
:END:

Now our keyrings will be back to their original state:

#+call: show_keys()

#+RESULTS:
:RESULTS:
"Session Keyring
 694337165 --alswrv   1000 65534  keyring: _uid_ses.1000
 571672433 --alswrv   1000 65534   \\_ keyring: _uid.1000
"
:END:

** resolve a key
So far we've talked about manually adding, looking at, and deleting
keys. The key resolution system lets us write or use user-space code
to add special keys to the kernel cache. 

A "debug" resolver is included by default in the keyctl package and is
defined in the resolver configuration. We can use this to demonstrate
using a resolver from the command line:

#+name: req_key
#+headers: :var DESC="debug:test"
#+headers: :var CALLOUT="some content"
#+begin_src sh
  keyctl request2 user "$DESC" "$CALLOUT"
#+end_src

#+RESULTS: req_key
:RESULTS:
254682454
:END:

Now that the key has been resolved, we can print it's contents:

#+call: print_key(KEYNUM=req_key())

#+RESULTS:
:RESULTS:
"Debug some content
"
:END:

The "debug" resolver drops the content of the "callout info" (here,
"some content") in to the key:

#+begin_src sh
    keyctl instantiate $1 "Debug $3" $4 || exit 1
#+end_src

This brings us to a discussion of how the resolution system works.

